### Recommendations with MovieTweetings: Getting to Know The Data

Throughout this lesson, you will be working with the [MovieTweetings Data](https://github.com/sidooms/MovieTweetings/tree/master/recsyschallenge2014).

**Note:** There are solutions to each of the notebooks available by hitting the orange jupyter logo in the top left of this notebook.  Additionally, you can watch me work through the solutions on the screencasts that follow each workbook. 

To get started, read in the libraries and the two datasets you will be using throughout the lesson using the code below.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import tests as t

%matplotlib inline


# Read in the MovieTweetings dataset originally taken from https://github.com/sidooms/MovieTweetings/tree/master/latest
movies = pd.read_csv('movies.dat', delimiter='::', header=None, names=['movie_id', 'movie', 'genre'], dtype={'movie_id': object}, engine='python')
reviews = pd.read_csv('ratings.dat', delimiter='::', header=None, names=['user_id', 'movie_id', 'rating', 'timestamp'], dtype={'movie_id': object, 'user_id': object, 'timestamp': object}, engine='python')

#### 1. Take a Look At The Data 

Take a look at the data and use your findings to fill in the dictionary below with the correct responses to show your understanding of the data.

In [2]:
# cell for work
movies.head(10)

,movie_id,movie,genre
0,0000008,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short
1,0000010,La sortie des usines Lumière (1895),Documentary|Short
2,0000012,The Arrival of a Train (1896),Documentary|Short
3,25,The Oxford and Cambridge University Boat Race ...,NaN
4,0000091,Le manoir du diable (1896),Short|Horror
5,0000131,Une nuit terrible (1896),Short|Comedy|Horror
6,0000417,A Trip to the Moon (1902),Short|Action|Adventure|Comedy|Fantasy|Sci-Fi
7,0000439,The Great Train Robbery (1903),Short|Action|Crime|Western
8,0443,"Hiawatha, the Messiah of the Ojibway (1903)",NaN
9,0000628,The Adventures of Dollie (1908),Action|Short

In [3]:
# The number of movies in the dataset
print(f"The number of movies: {len(movies)}")

The number of movies: 35479

In [4]:
# cell for work
reviews.head(10)

  user_id  movie_id  rating   timestamp
0       1   0114508       8  1381006850
1       2   0208092       5  1586466072
2       2   0358273       9  1579057827
3       2  10039344       5  1578603053
4       2   6751668       9  1578955697
5       2   7131622       8  1579559244
6       2   7975244       6  1583706305
7       2   7984734       7  1579949842
8       2   8367814       8  1586436354
9       2   8579674      10  1579261830

In [5]:
# The number of ratings in the dataset
print(f"The number of ratings: {len(reviews)}")

The number of ratings: 863866

In [6]:
# more work
movies['genre_split'] = movies.genre.str.split('|')
movies.head()

,movie_id,movie,genre,genre_split
0,0000008,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short,"[Documentary, Short]"
1,0000010,La sortie des usines Lumière (1895),Documentary|Short,"[Documentary, Short]"
2,0000012,The Arrival of a Train (1896),Documentary|Short,"[Documentary, Short]"
3,25,The Oxford and Cambridge University Boat Race ...,NaN,NaN
4,0000091,Le manoir du diable (1896),Short|Horror,"[Short, Horror]"

In [7]:
# The number of different genres
genre_dict = {}
for movie in movies['genre_split'].dropna():
    for j in movie:
        genre_dict[j] = genre_dict.get(j, 0) + 1
        
print(f'Types in movies: {genre_dict.keys()}\n')
print(f"There're total {len(genre_dict.keys())} different genres")
genre_dict

Types in movies: dict_keys(['Documentary', 'Short', 'Horror', 'Comedy', 'Action', 'Adventure', 'Fantasy', 'Sci-Fi', 'Crime', 'Western', 'Drama', 'Romance', 'History', 'Family', 'War', 'Sport', 'Biography', 'Mystery', 'Thriller', 'Animation', 'Music', 'Musical', 'Film-Noir', 'Adult', 'Talk-Show', 'News', 'Reality-TV', 'Game-Show'])

There're total 28 different genres

{'Documentary': 3349,
 'Short': 1458,
 'Horror': 4413,
 'Comedy': 11050,
 'Action': 5303,
 'Adventure': 3196,
 'Fantasy': 2232,
 'Sci-Fi': 2426,
 'Crime': 4832,
 'Western': 505,
 'Drama': 18066,
 'Romance': 6117,
 'History': 1366,
 'Family': 1977,
 'War': 1237,
 'Sport': 876,
 'Biography': 1817,
 'Mystery': 2715,
 'Thriller': 7501,
 'Animation': 1289,
 'Music': 1212,
 'Musical': 837,
 'Film-Noir': 281,
 'Adult': 10,
 'Talk-Show': 4,
 'News': 111,
 'Reality-TV': 8,
 'Game-Show': 1}

In [8]:
# The number of unique users in the dataset
len(reviews['user_id'].unique())
print(f"The number of unique users: {len(reviews['user_id'].unique())}")

The number of unique users: 67353

In [9]:
# The number missing ratings in the reviews dataset
reviews['rating'].isna().sum()
print(f"There're {reviews['rating'].isna().sum()} missing ratings in the reviews dataset")

There're 0 missing ratings in the reviews dataset

In [10]:
# The average rating given across all ratings
reviews['rating'].mean()
print(f"The average rating is {round(reviews['rating'].mean(), 2)}")

The average rating is 7.32

In [11]:
# The minimum rating given across all ratings
reviews['rating'].min()
print(f"The min rating is {reviews['rating'].min()}.")

The min rating is 0.

In [12]:
# The maximum rating given across all ratings
reviews['rating'].max()
print(f"The max rating is {reviews['rating'].max()}")

The max rating is 10

In [13]:
# Use your findings to match each variable to the correct statement in the dictionary
a = len(movies)
b = len(reviews)
c = len(genre_dict.keys())
d = len(reviews['user_id'].unique())
e = reviews['rating'].isna().sum()
f = np.round(reviews['rating'].mean(), 2)
g = reviews['rating'].min()
h = reviews['rating'].max()


dict_sol1 = {
'The number of movies in the dataset':a,
'The number of ratings in the dataset':b,
'The number of different genres':c,
'The number of unique users in the dataset':d,
'The number missing ratings in the reviews dataset':e,
'The average rating given across all ratings':f,
'The minimum rating given across all ratings':g,
'The maximum rating given across all ratings':h
}

# Originally, I had this to check your solution, but the 
# links are live and updating.  That didn't end up being
# a great idea
dict_sol1

{'The number of movies in the dataset': 35479,
 'The number of ratings in the dataset': 863866,
 'The number of different genres': 28,
 'The number of unique users in the dataset': 67353,
 'The number missing ratings in the reviews dataset': 0,
 'The average rating given across all ratings': 7.3200000000000003,
 'The minimum rating given across all ratings': 0,
 'The maximum rating given across all ratings': 10}

#### 2. Data Cleaning

Next, we need to pull some additional relevant information out of the existing columns. 

For each of the datasets, there are a couple of cleaning steps we need to take care of:

#### Movies
* Pull the date from the title and create new column
* Dummy the date column with 1's and 0's for each century of a movie (1800's, 1900's, and 2000's)
* Dummy column the genre with 1's and 0's

#### Reviews
* Create a date out of time stamp

You can check your results against the header of my solution by running the cell below with the **show_clean_dataframes** function.

In [14]:
## Movies
# Pull the date from the title and create new column
movies['date'] = movies['movie'].str.split('(').str[1].str[:-1]
movies.head()

,movie_id,movie,genre,genre_split,date
0,0000008,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short,"[Documentary, Short]",1894
1,0000010,La sortie des usines Lumière (1895),Documentary|Short,"[Documentary, Short]",1895
2,0000012,The Arrival of a Train (1896),Documentary|Short,"[Documentary, Short]",1896
3,25,The Oxford and Cambridge University Boat Race ...,NaN,NaN,1895
4,0000091,Le manoir du diable (1896),Short|Horror,"[Short, Horror]",1896

In [15]:
# Dummy the date column with 1's and 0's for each century of a movie (1800's, 1900's, and 2000's)

def year_dummy(d):
    if d[:2] == yr:
        return 1
    else:
        return 0

for yr in ['18', '19', '20']:
    movies[yr + "00's"] = movies['date'].apply(year_dummy)
    
movies.head()

,movie_id,movie,genre,genre_split,date,1800's,1900's,2000's
0,0000008,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short,"[Documentary, Short]",1894,1,0,0
1,0000010,La sortie des usines Lumière (1895),Documentary|Short,"[Documentary, Short]",1895,1,0,0
2,0000012,The Arrival of a Train (1896),Documentary|Short,"[Documentary, Short]",1896,1,0,0
3,25,The Oxford and Cambridge University Boat Race ...,NaN,NaN,1895,1,0,0
4,0000091,Le manoir du diable (1896),Short|Horror,"[Short, Horror]",1896,1,0,0

In [16]:
# It spent so much time...Zzzzz
# movies["1800's"] = 0
# movies["1900's"] = 0
# movies["2000's"] = 0

# for d in range(len(movies['date'])):
#     if movies['date'][d][:2] == '18':
#         movies["1800's"][d] = 1
#     elif (movies['date'][d][:2] == '18'):
#         movies["1900's"][d] = 1
#     else:
#         movies["2000's"][d] = 1
        
# movies.head(10)

In [37]:
# Dummy column the genre with 1's and 0's
genres = set()
for row in movies['genre_split']:
    if isinstance(row, float):
        continue
    genres = genres.union(set(row))
        
for genre in list(genres):
    movies[genre] = movies['genre_split'].fillna(0).apply(lambda cell: 1 if (cell != 0) and (genre in cell) else 0)

In [41]:
## Reviews
reviews.head()

  user_id  movie_id  rating   timestamp
0       1   0114508       8  1381006850
1       2   0208092       5  1586466072
2       2   0358273       9  1579057827
3       2  10039344       5  1578603053
4       2   6751668       9  1578955697

In [49]:
reviews['date'] = pd.to_datetime(reviews['timestamp'], unit='s')
reviews.head()

  user_id  movie_id  rating   timestamp                date
0       1   0114508       8  1381006850 2013-10-05 21:00:50
1       2   0208092       5  1586466072 2020-04-09 21:01:12
2       2   0358273       9  1579057827 2020-01-15 03:10:27
3       2  10039344       5  1578603053 2020-01-09 20:50:53
4       2   6751668       9  1578955697 2020-01-13 22:48:17

In [ ]:
# and another

In [ ]:
# and a few more below, which you can use as necessary

In [50]:
reviews_new, movies_new = t.show_clean_dataframes()

   Unnamed: 0  user_id  movie_id  rating   timestamp                 date  \
0           0        1     68646      10  1381620027  2013-10-12 23:20:27
1           1        1    113277      10  1379466669  2013-09-18 01:11:09
2           2        2    422720       8  1412178746  2014-10-01 15:52:26
3           3        2    454876       8  1394818630  2014-03-14 17:37:10
4           4        2    790636       7  1389963947  2014-01-17 13:05:47

   month_1  month_2  month_3  month_4    ...      month_9  month_10  month_11  \
0        0        0        0        0    ...            0         1         0
1        0        0        0        0    ...            0         0         0
2        0        0        0        0    ...            0         1         0
3        0        0        0        0    ...            0         0         0
4        0        0        0        0    ...            0         0         0

   month_12  year_2013  year_2014  year_2015  year_2016  year_2017  year_2018
0         0          1          0          0          0          0          0
1         0          1          0          0          0          0          0
2         0          0          1          0          0          0          0
3         0          0          1          0          0          0          0
4         0          0          1          0          0          0          0

[5 rows x 24 columns]
   Unnamed: 0  movie_id                                              movie  \
0           0         8      Edison Kinetoscopic Record of a Sneeze (1894)
1           1        10                La sortie des usines Lumière (1895)
2           2        12                      The Arrival of a Train (1896)
3           3        25  The Oxford and Cambridge University Boat Race ...
4           4        91                         Le manoir du diable (1896)

               genre  date  1800's  1900's  2000's  History  News    ...     \
0  Documentary|Short  1894       1       0       0        0     0    ...
1  Documentary|Short  1895       1       0       0        0     0    ...
2  Documentary|Short  1896       1       0       0        0     0    ...
3                NaN  1895       1       0       0        0     0    ...
4       Short|Horror  1896       1       0       0        0     0    ...

   Fantasy  Romance  Game-Show  Action  Documentary  Animation  Comedy  Short  \
0        0        0          0       0            1          0       0      1
1        0        0          0       0            1          0       0      1
2        0        0          0       0            1          0       0      1
3        0        0          0       0            0          0       0      0
4        0        0          0       0            0          0       0      1

   Western  Thriller
0        0         0
1        0         0
2        0         0
3        0         0
4        0         0

[5 rows x 36 columns]